boss/config/ims/ADD_HSDAINF.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Authentication>
			<Username>#{user}</Username>
			<Password>#{password}</Password>
		</Authentication>
		<MessageID>#{seq}</MessageID>
		<MEName>HSS</MEName>
	</soap:Header>
	<soap:Body>
		<ADD_HSDAINF xmlns="http://www.huawei.com/IMS/HSSV900R009C00SPC200">
			<IMPI>+8620#{businessKey}@ims.kongguanju.com</IMPI>
			<HUSERNAME>+8620#{businessKey}@ims.kongguanju.com</HUSERNAME>
			<PWD>202009</PWD>
			<REALM>ims.kongguanju.com</REALM>
		</ADD_HSDAINF>
	</soap:Body>
</soap:Envelope> 
